БухЭксп/Reports/CW_ОтчетПоКассе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>CW_ОтчетПоКассе</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

БухЭксп/Reports/CW_ОтчетПоКассе/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Касса",Отчет.Касса);
	Параметры.Свойство("НачалоПериода",Отчет.НачалоПериода);
	Параметры.Свойство("КонецПериода",Отчет.КонецПериода);
	
	Если ЗначениеЗаполнено(Отчет.Касса) Тогда
		СформироватьПриОткрытии = Истина;
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.НастройкиОтчета.Пометка = Истина;
	
	Если НЕ ЗначениеЗаполнено(Отчет.НачалоПериода) Тогда
		Отчет.НачалоПериода = '20120101';
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Отчет.КонецПериода) Тогда
		Отчет.КонецПериода = ТекущаяДата();	
	КонецЕсли; 
	
	Если СформироватьПриОткрытии Тогда
		СкрытьНастройки();
		СформироватьОтчет_Сервер();
	КонецЕсли; 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура НастройкиОтчета(Команда)
	
	Если Элементы.НастройкиОтчета.Пометка Тогда
		СкрытьНастройки();
	Иначе
		ПоказатьНастройки();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьНастройки()
	
	Элементы.ГруппаНастройки.Видимость = Ложь;
	Элементы.НастройкиОтчета.Пометка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНастройки()
	
	Элементы.ГруппаНастройки.Видимость = Истина;
	Элементы.НастройкиОтчета.Пометка = Истина;
	
КонецПроцедуры
	
// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ВыбПериодНажатие(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияПериода",ЭтотОбъект); 
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Период;
	Диалог.Период.ДатаНачала = НачалоДня(Отчет.НачалоПериода);
	Диалог.Период.ДатаОкончания = КонецДня(Отчет.КонецПериода);
	Диалог.Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	Диалог.Показать(ПОВ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияПериода(ОтветПериод, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ОтветПериод <> Неопределено) Тогда
		
		Отчет.НачалоПериода = НачалоДня(ОтветПериод.ДатаНачала);
		Отчет.КонецПериода  = КонецДня(ОтветПериод.ДатаОкончания);
		Период = ОтветПериод;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если НЕ ЗначениеЗаполнено(Отчет.Касса) Тогда
		_УФК.ВывестиПредупреждение("Выберите кассу!");
		Возврат;
	КонецЕсли;
	
	СкрытьНастройки();
	СформироватьОтчет_Сервер();
		
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет_Сервер()
	
	ЭтаФорма.Результат.Очистить();
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.СформироватьОтчет(Результат);
	
КонецПроцедуры

// ----------------------------------------------------------------------------
